disease_dic = {
    'Apple___Apple_scab': """ <b>Урожай</b>: яблоня <br/>Болезнь: парша яблони<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Парша яблони зимует преимущественно в опавших листьях и в почве. Развитию болезни способствует влажная прохладная погода, которая обычно бывает весной и в начале лета.

         <br/> 2. Споры грибов переносятся ветром, дождем или брызгами воды с земли на цветы, листья или плоды. В сырые или дождливые периоды только что распустившиеся листья яблони чрезвычайно восприимчивы к заражению. Чем дольше листья остаются влажными, тем тяжелее будет инфекция. Парша яблони быстро распространяется при температуре от 55 до 75 градусов по Фаренгейту.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. По возможности выбирайте устойчивые сорта.

         <br/>2. Сгребите под деревьями и уничтожьте зараженные листья, чтобы уменьшить количество спор грибка, доступных для повторного запуска цикла болезни следующей весной.
        
         <br/>3. Поливайте в вечерние или ранние утренние часы (избегайте дождевания), чтобы дать листьям время высохнуть до того, как может произойти заражение.
         <br/>4. Разложите слой компоста толщиной от 3 до 6 дюймов под деревьями, держа его подальше от ствола, чтобы покрыть почву и предотвратить распространение грибковых спор брызгами.""",

    'Apple___Black_rot': """ <b>Урожай</b>: Яблоня <br/>Болезнь: Черная гниль<br/>
         <br/> Причина заболевания:

         <br/><br/>Черную гниль вызывает грибок Diplodia seriata (syn. Botryosphaeria obtusa). Грибок может поражать отмершие ткани, а также живые стволы, ветки, листья и плоды. В сырую погоду споры этих инфекций выделяются и распространяются ветром или брызгами воды. Грибок поражает листья и плоды через естественные отверстия или мелкие ранки.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Обрежьте сухие или больные ветки.

         <br/>2. Обрежьте сухие или больные ветки.
        
         <br/>3. Удалите зараженный растительный материал с участка.
         <br/>4. Удалите зараженный растительный материал с участка.
         <br/>5. Обязательно удаляйте пни срезанных яблонь. Мертвые пни могут быть источником спор.""",

    'Apple___Cedar_apple_rust': """ <b>Урожай</b>: Яблоня <br/>Болезнь: Кедр Яблоневая ржавчина<br/>
         <br/> Причина заболевания:

         <br/><br/>Кедровая яблоневая ржавчина (Gymnosporangium juniperi-virginianae) — это грибковое заболевание, распространение и развитие которого зависит от двух видов. Часть своего двухлетнего жизненного цикла он проводит на восточном красном кедре (Juniperus virginiana). Споры возбудителя развиваются поздней осенью на можжевельнике в виде красновато-коричневых галлов на молодых ветвях деревьев.

         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Поскольку можжевельниковые галлы являются источником спор, поражающих яблони, их срезание является разумной стратегией, если их не слишком много.

         <br/>2. Хотя споры могут распространяться на многие мили, большинство из них, которые могут заразить ваше дерево, находятся в пределах нескольких сотен футов.
        
         <br/>3. Лучший способ сделать это — обрезать ветки примерно на 4-6 дюймов ниже галлов.""",



    'Apple___healthy': """ <b>Урожай</b>: яблоня <br/>Болезнь: нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",




    'Blueberry___healthy': """ <b>Урожай</b>: черника <br/>Болезнь: нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",




    'Cherry_(including_sour)___Powdery_mildew': """ <b>Урожай</b>: вишня <br/>Болезнь: мучнистая роса<br/>
         <br/> Причина заболевания:

         <br/><br/>Podosphaera clandestina, грибок, который чаще всего поражает молодые, разрастающиеся листья, но также может быть обнаружен на почках, плодах и стеблях. Зимует в виде маленьких круглых черных телец (хасмотеций) на опавших листьях, на полу в саду или в разветвлениях деревьев. Колонии производят больше (бесполых) спор, как правило, вокруг падения шелухи и продолжают цикл болезни.


         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Удалите и уничтожьте пасынки.

         <br/>2. Не допускайте попадания поливной воды на развивающиеся плоды и листья, используя полив, который не смачивает листья. Кроме того, делайте наборы для орошения как можно короче.
        
         <br/>3. Следуйте культурным практикам, которые способствуют хорошей циркуляции воздуха, таким как обрезка и умеренный рост побегов за счет разумного управления азотом.""",

    'Cherry_(including_sour)___healthy': """ <b>Урожай</b>: Вишня <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",


    'Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot': """ <b>Культура</b>: Кукуруза <br/>Болезнь: Серая пятнистость листьев<br/>
         <br/> Причина заболевания:

         <br/><br/>Серая пятнистость на листьях кукурузы препятствует фотосинтетической активности, уменьшая количество углеводов, выделяемых на наполнение зерна. Степень, в которой серая пятнистость листьев наносит ущерб урожайности, можно оценить на основе степени заражения листьев по сравнению с зерновым наполнителем. Повреждения могут быть более серьезными, когда развивающиеся поражения выходят за пределы колосовидного листа во время опыления. Поскольку уменьшение функционирующей площади листа ограничивает фотосинтез, направленный на наполнение зерна, растение может мобилизовать больше углеводов из стебля для наполнения зерна.


         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Чтобы наилучшим образом предотвратить и контролировать серую пятнистость листьев кукурузы, общий подход заключается в снижении скорости роста и распространения болезни.

         <br/>2. Это достигается за счет ограничения количества циклов вторичных заболеваний и защиты листовой поверхности от повреждений до формирования зерна кукурузы.
        
         <br/>3. Факторы высокого риска серой пятнистости листьев кукурузы: <br/>
                     а. Восприимчивый гибрид
                     б. Непрерывная кукуруза
                     в. Поздний срок посева
                     д. Системы минимальной обработки почвы
                     е. Полевой анамнез тяжелого заболевания
                     ф. Ранняя активность болезни (до появления кисточек)
                     г. Орошение
                     час Благоприятный прогноз погоды для заболевания.""",




    'Corn_(maize)___Common_rust_': """ <b>Культура</b>: Кукуруза (кукуруза) <br/>Болезнь: Обыкновенная ржавчина<br/>
         <br/> Причина заболевания:

         <br/><br/>Обыкновенная ржавчина кукурузы, вызываемая грибком Puccinia sorghi, является наиболее часто встречающейся из двух первичных ржавчинных болезней кукурузы в США, но она редко вызывает значительные потери урожая на кукурузе поля Огайо (вмятина). . Иногда полевая кукуруза, особенно в южной половине штата, серьезно поражается, когда погодные условия благоприятствуют развитию и распространению грибка ржавчины.

         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Хотя ржавчина часто встречается на кукурузе в Огайо, очень редко возникает необходимость в применении фунгицидов. Это связано с тем, что существуют высокоустойчивые гибриды полевой кукурузы, и большинство из них обладают определенной степенью устойчивости.

         <br/>2. Однако попкорн и сладкая кукуруза могут быть весьма восприимчивы. В сезоны, когда на нижних листьях до шелушения присутствует значительное количество ржавчины, а погода не по сезону прохладная и влажная, для эффективной борьбы с болезнями может потребоваться раннее применение фунгицидов. Для борьбы с ржавчиной доступны многочисленные фунгициды. """,


    'Corn_(maize)___Northern_Leaf_Blight': """ <b>Культура</b>: Кукуруза (кукуруза) <br/>Болезнь: Северная пятнистость листьев
         <br/>
         <br/> Причина заболевания:

         <br/><br/>Северная пятнистость листьев кукурузы (NCLB) — лиственное заболевание кукурузы (кукурузы), вызываемое Exserohilum turcicum, анаморфой аскомицета Setosphaeria turcica. Благодаря своим характерным сигарообразным поражениям это заболевание может привести к значительной потере урожая восприимчивых гибридов кукурузы.

         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Борьба с NCLB может быть достигнута в первую очередь за счет использования устойчивых гибридов, но, поскольку устойчивость может быть неполной или неполной, целесообразно использовать комплексный подход с различными методами возделывания культур и фунгицидами.

         <br/>2. Обследование полей и мониторинг местных условий жизненно важны для борьбы с этим заболеванием.""",


    'Grape___Black_rot': """ <b>Урожай</b>: Виноград <br/>Болезнь: Черная гниль<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Грибок черной гнили зимует в побегах, усиках и листьях на виноградной лозе и на земле. Мумифицированные ягоды на земле или те, которые все еще цепляются за лозы, становятся основным источником инфекции следующей весной.

         <br/> 2. Во время дождя микроскопические споры (аскоспоры) выбрасываются из многочисленных черных плодовых тел (перитециев) и токами воздуха переносятся на молодые, разрастающиеся листья. В присутствии влаги эти споры прорастают через 36–48 часов и в конечном итоге проникают в листья и плодоножки.

         <br/> 3. Инфекция становится заметной через 8-25 дней. В сырую погоду споры могут выделяться всю весну и лето, обеспечивая непрерывное заражение.


         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Правильно расположите лозы и выберите место для посадки, где лозы будут подвергаться воздействию солнечных лучей и хорошей циркуляции воздуха. Держите лозы над землей и убедитесь, что они правильно подвязаны, ограничивая время, в течение которого лозы остаются влажными, что снижает риск заражения.

         <br/>2. Держите фруктовые посадки и прилегающие территории свободными от сорняков и высокой травы. Эта практика будет способствовать более низкой относительной влажности и быстрому высыханию лоз и тем самым ограничить грибковую инфекцию.
        
         <br/>3. Используйте защитные фунгицидные спреи. Пестициды, зарегистрированные для защиты развивающихся новых побегов, включают медь, каптан, фербам, манкоцеб, манеб, триадимефон и зирам. Важно время опрыскивания, когда новые побеги имеют длину от 2 до 4 дюймов, и снова, когда они достигают длины от 10 до 15 дюймов, непосредственно перед цветением, сразу после цветения и когда завязываются плоды.""",

    'Corn_(maize)___healthy': """ <b>Культура</b>: Кукуруза (кукуруза) <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",


    'Grape___Esca_(Black_Measles)': """ <b>Урожай</b>: Виноград <br/>Болезнь: Черная корь<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Черная корь вызывается комплексом грибов, который включает несколько видов Phaeoacremonium, прежде всего P. aleophilum (известный в настоящее время по названию своей половой стадии Togninia minima) и Phaeomoniella chlamydospora. .

         <br/> 2. Зимующие структуры, образующие споры (перитеции или пикниды, в зависимости от возбудителя), внедряются в больные древесные части виноградных лоз. Зимующие структуры, образующие споры (перитеции или пикниды, в зависимости от возбудителя), внедряются в больные древесные части виноградных лоз.

         <br/> 3. Во время осенне-весенних дождей споры высвобождаются, а раны, полученные в результате обрезки в состоянии покоя, становятся местами заражения.

         <br/> 4. Раны могут оставаться восприимчивыми к инфекции в течение нескольких недель после обрезки, при этом восприимчивость со временем снижается.


         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Постинфекционные методы (санация и хирургия винограда) для использования на больных, зрелых виноградниках не так эффективны и обходятся гораздо дороже, чем применение профилактических методов (отсроченная обрезка, двойная обрезка и применение средств защиты от обрезки) на молодых виноградниках.


         <br/>2. Санитария и хирургия винограда могут помочь сохранить урожайность. Весной ищите мертвые шпоры или чахлые побеги. Позже летом, когда вероятность дождя уменьшается, соблюдайте правила санитарии, отрезая эти пораженные язвами части лозы за пределами язвы, там, где древесина выглядит здоровой. Затем удалите с виноградника больные, древесные остатки и уничтожьте его.
        
         <br/>3. Фунгициды, помеченные как средства защиты от обрезки, рассмотрите возможность использования альтернативных материалов, таких как герметик для ран с 5-процентным содержанием борной кислоты в акриловой краске (Tech-Gro B-Lock), который эффективен против отмирания Eutypa и Esca, или эфирное масло ( Safecoat VitiSeal).""",

    'Grape___Leaf_blight_(Isariopsis_Leaf_Spot)': """ <b>Урожай</b>: виноград <br/>Болезнь: пятнистость листьев<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Парша яблони зимует преимущественно в опавших листьях и в почве. Развитию болезни способствует влажная прохладная погода, которая обычно бывает весной и в начале лета.

         <br/> 2. Споры грибов переносятся ветром, дождем или брызгами воды с земли на цветы, листья или плоды. В сырые или дождливые периоды только что распустившиеся листья яблони чрезвычайно восприимчивы к заражению. Чем дольше листья остаются влажными, тем тяжелее будет инфекция. Парша яблони быстро распространяется при температуре от 55 до 75 градусов по Фаренгейту.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. По возможности выбирайте устойчивые сорта.

         <br/>2. Сгребите под деревьями и уничтожьте зараженные листья, чтобы уменьшить количество спор грибка, доступных для повторного запуска цикла болезни следующей весной.
        
         <br/>3. Поливайте в вечерние или ранние утренние часы (избегайте дождевания), чтобы дать листьям время высохнуть до того, как может произойти заражение.
         <br/>4. Разложите слой компоста толщиной от 3 до 6 дюймов под деревьями, держа его подальше от ствола, чтобы покрыть почву и предотвратить распространение грибковых спор брызгами.""",

    'Grape___healthy': """ <b>Урожай</b>: Виноград <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",


    'Corn_(maize)___healthy': """ <b>Культура</b>: Кукуруза (кукуруза) <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",


    'Grape___Leaf_blight_(Isariopsis_Leaf_Spot)': """<b> Культура</b> : Виноград <br/> Болезнь: Пятнистость листьев""",


    'Orange___Haunglongbing_(Citrus_greening)': """ <b>Урожай</b>: апельсин <br/>Болезнь: позеленение цитрусовых<br/>
         <br/> Причина заболевания:

         <br/><br/> Huanglongbing (HLB), или позеленение цитрусовых, является наиболее серьезной болезнью цитрусовых, которая в настоящее время разрушает цитрусовую промышленность во всем мире. Предполагаемый возбудитель Candidatus Liberibacter spp. влияет на здоровье дерева, а также на развитие плодов, созревание и качество цитрусовых и сока.


         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. В регионах с низкой заболеваемостью наиболее распространенными методами являются предотвращение распространения инфекции путем удаления деревьев с симптомами заболевания, защита краев рощ путем интенсивного мониторинга, использования пестицидов и биологического контроля над ACP-переносчиками.

         <br/>2. По данным Singerman and Useche (2016), CHMA координируют применение инсектицидов для борьбы с распространением ACP по соседним коммерческим цитрусовым рощам по всей территории в рамках плана по борьбе с болезнью HLB.
        
         <br/>3. В дополнение к внекорневым питательным опрыскиваниям были безуспешно испытаны регуляторы роста растений для уменьшения опадения плодов, связанного с HLB (Albrigo and Stover, 2015).""",



    'Peach___Bacterial_spot': """ <b>Культура</b>: Персик. <br/>Болезнь: Бактериальная пятнистость<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Заболевание вызывают четыре вида Xanthomonas (X. euvesicatoria, X. gardneri, X. perforans и X. vesicatoria). В Северной Каролине преобладающим видом, вызывающим бактериальную пятнистость томатов, является X. perforans, а преобладающим видом, вызывающим заболевание перца, является X. euvesicatoria.

         <br/> 2. Все четыре бактерии являются строго аэробными, грамотрицательными палочками с длинным хлыстообразным жгутиком (хвостом), который позволяет им передвигаться в воде, что позволяет им проникать во влажные ткани растений и вызывать инфекцию.


         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Наиболее эффективной стратегией управления является использование свободных от патогенов сертифицированных семян и здоровых рассады для предотвращения проникновения патогена в теплицы и полевые производственные площади. Внимательно осматривайте растения и отбраковывайте зараженные рассады, в том числе и свои собственные!

         <br/>2. В теплицах для выращивания рассады сведите к минимуму чрезмерный полив и обращение с рассадой, когда она влажная.
        
         <br/>3. Лотки, скамейки, инструменты и конструкции теплицы следует мыть и дезинфицировать между посевами рассады.
         <br/>4. Не опрыскивайте, не подвязывайте, не собирайте и не трогайте влажные растения, так как это может привести к распространению болезни.""",


    'Pepper,_bell___Bacterial_spot': """ <b>Культура</b>: перец <br/>Болезнь: бактериальная пятнистость<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Бактериальную пятнистость вызывают несколько видов грамотрицательных бактерий рода Xanthomonas.

         <br/> 2. В культуре эти бактерии образуют желтые слизистые колонии. Можно наблюдать «массу» бактерий, просачивающихся из пораженного участка, сделав поперечный срез пораженного листа, поместив ткань в каплю воды, поместив покровное стекло на образец и исследуя его под микроскопом. ~200X)..
        
        
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Первичная стратегия борьбы с бактериальной пятнистостью начинается с использования сертифицированных свободных от патогенов семян и свободных от болезней трансплантатов.

         <br/>2. Бактерии плохо выживают после разложения материала-хозяина, поэтому рекомендуется севооборот. После того, как бактерии попали на поле или в теплицу, болезнь очень трудно контролировать.
        
         <br/>3. Растения перца обычно опрыскивают медьсодержащими бактерицидами, чтобы сохранить «защитный» покров на листве и плодах.""",

    'Peach___healthy': """ <b>Урожай</b>: Персик <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",

    'Pepper,_bell___healthy': """ <b>Культура</b>: перец <br/>Болезнь: болезнь отсутствует<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",


    'Potato___healthy': """ <b>Культура</b>: Картофель <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",

    'Raspberry___healthy': """ <b>Культура</b>: Малина <br/>Болезнь: Болезней нет<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",


    'Soybean___healthy': """ <b>Культура</b>: Соя <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",

    'Strawberry___healthy': """ <b>Урожай</b>: Клубника <br/>Болезнь: Нет болезни<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",

    'Tomato___healthy': """ <b>Культура</b>: помидоры <br/>Болезнь: болезнь отсутствует<br/>

         <br/><br/> Не волнуйтесь. Ваш урожай здоров. Так держать !!!""",


    'Potato___Early_blight': """ <b>Культура</b>: Картофель <br/>Болезнь: Ранняя гниль<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Фитофтороз (ЭБ) – заболевание картофеля, вызываемое грибком Alternaria solani. Встречается везде, где выращивают картофель.

         <br/> 2. Болезнь в первую очередь поражает листья и стебли, но при благоприятных погодных условиях и при отсутствии контроля может привести к значительной дефолиации и повысить вероятность заражения клубней. Преждевременная дефолиация может привести к значительному снижению урожайности.

         <br/> 3. Первичное заражение трудно предсказать, поскольку ЭБ меньше зависит от конкретных погодных условий, чем фитофтороз.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Сажайте только здоровые, сертифицированные семена.

         <br/>2. Соблюдайте полную и регулярную программу опрыскивания листвы фунгицидами.
        
         <br/>3. Практикуйте хорошие методы умерщвления, чтобы уменьшить заражение клубней.
         <br/>4. Дайте клубням созреть перед выкапыванием, выкапывайте, когда лозы сухие, а не влажные, и избегайте чрезмерного повреждения картофеля во время сбора урожая и обработки.""",


    'Potato___Late_blight': """ <b>Культура</b>: Картофель <br/>Болезнь: Фитофтороз<br/>

         Фитофтороз – потенциально разрушительное заболевание картофеля, поражающее листья, стебли и плоды растений. Болезнь быстро распространяется на полях и может привести к полной гибели урожая, если ее не лечить. Фитофтороз картофеля стал причиной картофельного голода в Ирландии в конце 1840-х годов.
         <br/> Причина заболевания:

         <br/><br/> 1. Фитофтороз вызывается оомицетом Phytophthora infestans. Оомицеты — это грибоподобные организмы, также называемые водяными плесенями, но они не являются настоящими грибами.

         <br/> 2. Существует множество различных штаммов P. infestans. Они называются клональными линиями и обозначаются числовым кодом (например, US-23). Многие клональные линии поражают как помидоры, так и картофель, но некоторые линии специфичны для того или иного хозяина.
         <br/> 3. Диапазон растений-хозяев обычно ограничивается картофелем и помидорами, но паслен мохнатый (Solanum physalifolium) является близкородственным сорняком, который может легко инфицироваться и способствовать распространению болезни. В идеальных условиях, например в теплице, петуния тоже может заразиться.
        
        
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Заражение семян маловероятно для семян томатов, приготовленных в промышленных масштабах, или для сохраненных семян, которые были тщательно высушены.

         <br/>2. Перед покупкой и/или посадкой осмотрите рассаду томатов на наличие симптомов фитофтороза, так как рассады томатов, доставленные из южных регионов, могут быть инфицированы.
        
         <br/>3. Если инфекция обнаружена только на нескольких растениях в пределах поля, инфицированные растения следует удалить, вырезать диском, уничтожить гербицидом или пламенем, чтобы избежать распространения по всему полю.""",


    'Squash___Powdery_mildew': """ <b>Культура</b>: Тыква <br/>Болезнь: Мучнистая роса<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Заражение мучнистой росой благоприятствует влажным условиям с температурой около 68-81° F.

         <br/> 2. В теплых и сухих условиях образуются новые споры, которые легко распространяют болезнь.
         <br/> 3. Первые симптомы мучнистой росы появляются в середине или конце лета в штате Миннесота. Старые листья более восприимчивы, и мучнистая роса заражает их в первую очередь.
         <br/> 4. Ветер разносит споры, образующиеся в пятнистости листьев, чтобы заразить другие листья.
         <br/> 5. При благоприятных условиях мучнистая роса может распространяться очень быстро, часто покрывая все листья.

         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Внесите удобрения на основе результатов анализа почвы. Избегайте чрезмерного применения азота.

         <br/>2. Обеспечьте хорошую циркуляцию воздуха вокруг растений за счет надлежащего расстояния, размещения растений и борьбы с сорняками.
        
         <br/>3. Раз в неделю осматривайте пять зрелых листьев на предмет заражения мучнистой росой. В больших посадках повторите в 10 разных местах поля.
         <br/>4. Если восприимчивые сорта растут в районе, где мучнистая роса в прошлом приводила к потере урожая, может потребоваться фунгицид.""",


    'Strawberry___Leaf_scorch': """ <b>Урожай</b>: клубника <br/>Болезнь: ожог листьев<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Ожоги листьев земляники вызваны грибковой инфекцией, поражающей листву посадок земляники. Ответственный за это грибок называется Diplocarponearliana.

         <br/> 2. Клубника с ожогом листьев может сначала проявить признаки болезни в виде небольших пурпурных пятен, которые появляются на верхней стороне листьев.

         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Поскольку этот грибковый возбудитель зимует на опавших листьях растений, надлежащая санитарная обработка сада имеет ключевое значение.

         <br/>2. Это включает в себя удаление зараженного садового мусора с грядки клубники, а также частую установку новых пересадок клубники.
        
         <br/>3. Избегание переувлажнения почвы и частая уборка сада помогут снизить вероятность распространения этого грибка.""",



    'Tomato___Bacterial_spot': """ <b>Культура</b>: помидоры <br/>Болезнь: бактериальная пятнистость<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Заболевание вызывают четыре вида Xanthomonas (X. euvesicatoria, X. gardneri, X. perforans и X. vesicatoria). В Северной Каролине преобладающим видом, вызывающим бактериальную пятнистость томатов, является X. perforans, а преобладающим видом, вызывающим заболевание перца, является X. euvesicatoria.

         <br/> 2. Все четыре бактерии являются строго аэробными, грамотрицательными палочками с длинным хлыстообразным жгутиком (хвостом), который позволяет им передвигаться в воде, что позволяет им проникать во влажные ткани растений и вызывать инфекцию.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Наиболее эффективной стратегией управления является использование свободных от патогенов сертифицированных семян и здоровых рассады для предотвращения проникновения патогена в теплицы и полевые производственные площади. Внимательно осматривайте растения и отбраковывайте зараженные рассады, в том числе и свои собственные!

         <br/>2. В теплицах для выращивания рассады сведите к минимуму чрезмерный полив и обращение с рассадой, когда она влажная.
        
         <br/>3. Лотки, скамейки, инструменты и конструкции теплицы следует мыть и дезинфицировать между посевами рассады.
         <br/>4. Не опрыскивайте, не подвязывайте, не собирайте и не трогайте влажные растения, так как это может привести к распространению болезни.""",



    'Tomato___Early_blight': """ <b>Урожай</b>: томат <br/>Болезнь: ранняя гниль<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Фитофтороз может быть вызван двумя различными близкородственными грибами, Alternaria tomatophila и Alternaria solani.
         <br/> 2. Alternaria tomatophila более вирулентна для томатов, чем A. solani, поэтому в регионах, где обнаружена A. tomatophila, она является основной причиной ранней гнили томатов. Однако, если A.tomatophila отсутствует, A.solani вызовет раннюю гниль на помидорах.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Используйте семена, свободные от патогенов, или собирайте семена только с растений, свободных от болезней.

         <br/>2. Избавьтесь от томатов и родственных культур как минимум на два года.
        
         <br/>3. Контролируйте восприимчивые сорняки, такие как черный паслен и мохнатый паслен, а также добровольно сажайте помидоры на протяжении всего севооборота.
         <br/>4. Удобряйте правильно, чтобы поддерживать активный рост растений. В частности, не переусердствуйте с калием и поддерживайте адекватный уровень как азота, так и фосфора.
         <br/>5. Не работайте с растениями, когда они мокрые от дождя, орошения или росы.
         <br/>6. Используйте капельное орошение вместо дождевателя, чтобы листва оставалась сухой.""",



    'Tomato___Late_blight': """ <b>Культура</b>: помидоры <br/>Болезнь: фитофтороз<br/>

         Фитофтороз – потенциально разрушительное заболевание томатов, поражающее листья, стебли и плоды растений. Болезнь быстро распространяется на полях и может привести к полной гибели урожая, если ее не лечить.
         <br/> Причина заболевания:

         <br/><br/> 1. Фитофтороз вызывается оомицетом Phytophthora infestans. Оомицеты — это грибоподобные организмы, также называемые водяными плесенями, но они не являются настоящими грибами.

         <br/> 2. Существует множество различных штаммов P. infestans. Они называются клональными линиями и обозначаются числовым кодом (например, US-23). Многие клональные линии поражают как помидоры, так и картофель, но некоторые линии специфичны для того или иного хозяина.
         <br/> 3. Диапазон растений-хозяев обычно ограничивается картофелем и помидорами, но паслен мохнатый (Solanum physalifolium) является близкородственным сорняком, который может легко инфицироваться и способствовать распространению болезни. В идеальных условиях, например в теплице, петуния тоже может заразиться.""",



    'Tomato___Leaf_Mold': """ <b>Урожай</b>: Томаты <br/>Болезнь: Листовая плесень<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Листовая плесень вызывается грибком Passalora fulva (ранее называвшимся Fulvia fulva или Cladosporium fulvum). Неизвестно, что он является патогенным для какого-либо другого растения, кроме помидоров.

         <br/> 2. Пятна на листьях срастаются и буреют. Листья увядают и отмирают, но часто остаются прикрепленными к растению.
         <br/> 3. Инфицирование плодов начинается с появления гладких черных участков неправильной формы на конце плодоножки плода. По мере прогрессирования заболевания пораженный участок становится впалым, сухим и кожистым.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Используйте капельное орошение и избегайте полива листвы.

         <br/>2. Размещайте растения, чтобы обеспечить хорошее движение воздуха между рядами и отдельными растениями.
        
         <br/>3. Ставьте колья, нанизывайте или подрезайте, чтобы увеличить приток воздуха к растению и вокруг него.
         <br/>4. Стерилизуйте колья, шпалы, шпалеры и т. д. 10-процентным бытовым отбеливателем или коммерческим дезинфицирующим средством.
         <br/>5. Обеспечьте циркуляцию воздуха в теплицах или туннелях с помощью вентиляционных отверстий и вентиляторов, а также сверните высокие стенки туннеля, чтобы уменьшить влажность вокруг растений.
         <br/>6. Поддерживайте ночную температуру в теплицах выше наружной, чтобы избежать образования росы на листве.
         <br/>7. Удаляйте растительные остатки в конце сезона. Сожгите его или закопайте вдали от районов выращивания томатов.""",


    'Tomato___Septoria_leaf_spot': """ <b>Культура</b>: помидоры <br/>Болезнь: пятнистость листьев<br/>
         <br/> Причина заболевания:

         <br/><br/> Септориозная пятнистость листьев вызывается грибком Septoria lycopersici. Это одно из самых разрушительных заболеваний листвы томатов, которое особенно тяжело проявляется в районах, где влажная погода сохраняется в течение длительного времени.

         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Удалите больные листья.

         <br/>2. Улучшить циркуляцию воздуха вокруг растений.
        
         <br/>3. Мульча вокруг основания растений
         <br/>4. Не используйте верхний полив.
         <br/>5. Используйте фунгицидные спреи.""",



    'Tomato___Spider_mites Two-spotted_spider_mite': """ <b>Культура</b>: Томат. <br/>Болезнь: Двухпятнистый паутинный клещ<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Паутинный клещ двупятнистый – наиболее распространенный вид клещей, поражающий овощные и плодовые культуры.

         <br/> 2. Они дают до 20 поколений в год, им благоприятствует избыток азота, а также сухие и пыльные условия.
         <br/> 3. Вспышки часто вызываются использованием инсектицидов широкого спектра действия, которые воздействуют на многочисленных естественных врагов, помогающих управлять популяциями клещей.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Избегайте применения инсектицидов широкого спектра действия против других вредителей в начале сезона.

         <br/>2. Не вносите чрезмерных удобрений
        
         <br/>3. Верхнее орошение или продолжительные дожди могут помочь сократить популяцию.""",


    'Tomato___Target_Spo': """ <b>Урожай</b>: томат <br/>Болезнь: Target Spot<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Из-за грибка растения теряют листья; это серьезное заболевание. Если заражение происходит до того, как плоды разовьются, урожайность будет низкой.

         <br/> 2. Это распространенное заболевание томатов в островных странах Тихого океана. Заболевание встречается в ширмовом доме и в поле.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. Удалите несколько веток с нижней части растений, чтобы обеспечить лучший приток воздуха к основанию.

         <br/>2. Удалите и сожгите нижние листья, как только заметите болезнь, особенно после того, как были сорваны нижние кисти плодов.
        
         <br/>3. Держите участки свободными от сорняков, так как некоторые из них могут быть носителями грибка.
         <br/>4. Не используйте дождевание дождеванием; в противном случае это создаст условия для образования спор и заражения.""",


    'Tomato___Tomato_Yellow_Leaf_Curl_Virus': """ <b>Культура</b>: помидоры <br/>Болезнь: вирус желтой курчавости листьев<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. TYLCV передается насекомым-переносчиком Bemisia tabaci персистентно-циркулирующим неразмножающимся образом. Вирус может эффективно передаваться на взрослых стадиях.

         <br/> 2. Эта передача вируса имеет короткий период доступа для получения 15–20 минут и латентный период 8–24 часов.
         <br/><br/> Как предотвратить/вылечить болезнь <br/>
         <br/>1. В настоящее время наиболее эффективными методами борьбы с распространением TYLCV являются инсектициды и устойчивые сорта сельскохозяйственных культур.

         <br/>2. Эффективность инсектицидов не оптимальна в тропических районах из-за устойчивости белокрылки к инсектицидам; поэтому инсектициды следует чередовать или смешивать, чтобы обеспечить наиболее эффективное лечение против передачи вируса.
        
         <br/>3. Другие методы борьбы с распространением TYLCV включают посадку устойчивых/толерантных линий, севооборот и селекцию на устойчивость к TYLCV. Как и в случае со многими другими вирусами растений, одним из наиболее многообещающих методов борьбы с TYLCV является получение трансгенных растений томатов, устойчивых к TYLCV.""",




    'Tomato___Tomato_mosaic_virus': """ <b>Культура</b>: помидоры <br/>Болезнь: вирус мозаики<br/>
         <br/> Причина заболевания:

         <br/><br/> 1. Вирус томатной мозаики и вирус табачной мозаики могут существовать в течение двух лет в сухой почве или остатках листьев, но только в течение одного месяца, если почва влажная. Вирусы также могут сохраняться в зараженных остатках корней в почве до двух лет.

         <br/> 2. Семена могут быть заражены и передать вирус растению, но болезнь обычно заносится и распространяется главным образом в результате деятельности человека. Вирус может легко распространяться между растениями на руках, инструментах и одежде рабочих при обычных действиях, таких как подвязывание растений, удаление отростков и сбор урожая.
         <br/> 3. Вирус может выжить даже в процессе сушки табака и может распространяться от сигарет и других табачных изделий к растительному материалу, с которым рабочие обращаются после сигареты.


         <br/><br/> Как предотвратить/вылечить болезнь <br/>


         <br/>1. Покупайте трансплантаты только из надежных источников. Спросите о санитарных процедурах, которые они используют для предотвращения болезней.

         <br/>2. Осмотрите трансплантаты перед покупкой. Выбирайте только трансплантаты, не показывающие явных симптомов.
        
         <br/>3. Избегайте посадки на полях, где присутствуют остатки корней томатов, так как вирус может долго сохраняться в корнях.
         <br/>4. Мойте руки водой с мылом до и во время работы с растениями, чтобы уменьшить вероятность распространения между растениями."""
}
