fertilizer_dic = {
        'NHigh': """Значение азота в почве высокое и может привести к росту сорняков.
         <br/> Пожалуйста, обратите внимание на следующие предложения:

         <br/><br/> 1. <i> Навоз </i> – добавление навоза является одним из самых простых способов обогащения почвы азотом. Будьте осторожны, так как существуют различные виды навоза с разным содержанием азота.

         <br/> 2. <i>Кофейная мука </i> – используйте свою утреннюю зависимость, чтобы удовлетворить свою привычку работать в саду! Кофейная мука считается зеленым компостным материалом, богатым азотом. Как только земля разрушится, ваша почва будет питаться вкусным, вкусным азотом. Дополнительным преимуществом включения кофейной гущи в вашу почву является то, что она будет компостировать, а также поможет улучшить дренаж вашей почвы.

         <br/>3. <i>Сажать растения, фиксирующие азот</i>. Посадка овощей семейства Fabaceae, таких как горох, фасоль и соевые бобы, может увеличить содержание азота в почве.

         <br/>4. Высаживайте «зеленые удобрения», такие как капуста, кукуруза и брокколи.

         <br/>5. <i>Используйте мульчу (влажную траву, определенный материал, слоем которого покрывается поверхность земли вокруг стебля огородной культуры) при выращивании сельскохозяйственных культур.</i> В мульчу также могут входить опилки и обрезки мягкой древесины.""",

        'Nlow': """Значение азота в вашей почве низкое.
         <br/> Пожалуйста, обратите внимание на следующие предложения:
         <br/><br/> 1. <i>Добавьте в почву опилки или мелкую щепу</i> – углерод в опилках/щепе любит азот и помогает поглощать и впитывать избыток азота.

         <br/>2. <i>Сажать растения с высоким содержанием азота</i> — помидоры, кукуруза, брокколи, капуста и шпинат — примеры растений, которые процветают за счет азота и высасывают азот всухую.

         <br/>3. <i>Вода</i> — замачивание почвы водой поможет выщелачивать азот глубже в почву, оставляя растениям меньше азота.

         <br/>4. <i>Сахар</i>. В ограниченных исследованиях было показано, что добавление сахара в почву может потенциально помочь уменьшить количество азота в почве. Сахар частично состоит из углерода, элемента, который притягивает и поглощает азот в почве. Эта концепция аналогична добавлению опилок/щепы с высоким содержанием углерода.

         <br/>5. Добавьте компостированный навоз в почву.

         <br/>6. Посадите азотфиксирующие растения, такие как горох или бобы.

         <br/>7. <i>Используйте удобрения NPK с высоким содержанием азота.

         <br/>8. <i>Ничего не делать</i>. Это может показаться нелогичным, но если у вас уже есть растения, дающие много листвы, может быть лучше позволить им продолжать поглощать весь азот, чтобы улучшить почву для следующего выращивания. урожай.""",

        'PHigh': """Значение P вашей почвы высокое.
         <br/> Пожалуйста, обратите внимание на следующие предложения:

         <br/><br/>1. <i>Избегайте внесения навоза</i>. Навоз содержит много основных питательных веществ для вашей почвы, но, как правило, содержит большое количество фосфора. Ограничение добавления навоза поможет уменьшить добавление фосфора.

         <br/>2. <i>Используйте только бесфосфорные удобрения</i>. Если вы можете ограничить количество фосфора, добавляемого в почву, вы можете позволить растениям использовать существующий фосфор, при этом обеспечивая другие ключевые питательные вещества, такие как азот и калий. Найдите удобрение с такими числами, как 10-0-10, где ноль означает отсутствие фосфора.

         <br/>3. <i>Поливайте почву</i> — обильное замачивание почвы поможет вывести фосфор из почвы. Это рекомендуется как последнее усилие.

         <br/>4. Сажайте овощи, фиксирующие азот, чтобы увеличить количество азота без увеличения содержания фосфора (например, бобы и горох).

         <br/>5. Используйте севообороты для снижения высокого уровня фосфора""",

        'Plow': """Значение P вашей почвы низкое.
         <br/> Пожалуйста, обратите внимание на следующие предложения:

         <br/><br/>1. <i>Костная мука</i> – быстродействующий источник, изготовленный из перемолотых костей животных, богатых фосфором.

         <br/>2. <i>Фосфат</i> – более медленно действующий источник, где почва должна преобразовывать фосфаты в фосфор, который могут использовать растения.

         <br/>3. <i>Фосфорные удобрения</i> – внесение удобрений с высоким содержанием фосфора в соотношении NPK (пример: 10-20-10, где 20 – процент фосфора).

         <br/>4. <i>Органический компост</i> — добавление в почву качественного органического компоста поможет увеличить содержание фосфора.

         <br/>5. <i>Навоз</i> — как и компост, навоз может быть отличным источником фосфора для ваших растений.

         <br/>6. <i>Глинистая почва</i> — внесение частиц глины в почву может помочь сохранить и восполнить дефицит фосфора.

         <br/>7. <i>Обеспечение надлежащего pH почвы</i>. Научно доказано, что pH в диапазоне от 6,0 до 7,0 обеспечивает оптимальное поглощение фосфора растениями.

         <br/>8. Если рН почвы низкий, добавьте в почву известь или карбонат калия в качестве удобрений. Чистый карбонат кальция очень эффективен для повышения значения рН почвы.

         <br/>9. Если pH высокий, добавление значительного количества органического вещества поможет подкислить почву. Внесение подкисляющих удобрений, таких как сульфат аммония, может помочь снизить рН почвы.""",

        'KHigh': """Значение калия в вашей почве высокое</b>.
         <br/> Пожалуйста, обратите внимание на следующие предложения:

         <br/><br/>1. <i>Глубоко взрыхлите почву</i> лопатой и тщательно полейте, чтобы растворить водорастворимый калий. Дайте почве полностью высохнуть и повторите перекапывание и полив почвы еще два или три раза.

         <br/>2. <i>Просейте почву</i> и удалите как можно больше камней с помощью просеивателя для почвы. Минералы, встречающиеся в горных породах, такие как слюда и полевой шпат, медленно выделяют калий в почву в результате выветривания.

         <br/>3. Прекратите применять богатые калием коммерческие удобрения. Применяйте только коммерческие удобрения, у которых в поле конечного числа стоит «0». Коммерческие удобрения используют трехзначную систему для измерения уровней азота, фосфора и калия. Последняя цифра означает калий. Другой вариант — полностью отказаться от коммерческих удобрений и начать использовать только органические вещества для обогащения почвы.

         <br/>4. Смешайте с почвой измельченную яичную скорлупу, измельченные морские ракушки, древесную золу или фосфат мягкой породы, чтобы добавить кальций. Смешайте до 10 процентов органического компоста, чтобы улучшить и сбалансировать почву.

         <br/>5. Используйте удобрения NPK с низким содержанием калия и органические удобрения, так как они имеют низкие значения NPK.

         <br/>6. Выращивайте покровную культуру из бобовых, которые будут фиксировать азот в почве. Эта практика удовлетворит потребности почвы в азоте без увеличения содержания фосфора или калия.""",

        'Klow': """Значение K вашей почвы низкое.
         <br/>Пожалуйста, рассмотрите следующие предложения:

         <br/><br/>1. Смешайте с хлористым калием или сульфатом калия
         <br/>2. Попробуйте муку из водорослей или морских водорослей
         <br/>3. Попробуйте сульфат калия-магнезии (лангбейнит)
         <br/>4. Закопайте банановую кожуру на дюйм ниже поверхности почвы
         <br/>5. Используйте калийные удобрения, так как они содержат большое количество калия.
        """
    }